# encoding: utf-8
require 'spec_helper'

describe 'Numbers' do

  describe 'Male' do
    fixtures = [
      [0, 'нула'],
      [1, 'един'],
      [2, 'два'],
      [3, 'три'],
      [4, 'четири'],
      [5, 'пет'],
      [6, 'шест'],
      [7, 'седем'],
      [8, 'осем'],
      [9, 'девет'],
      [10, 'десет'],
      [11, 'единадесет'],
      [12, 'дванадесет'],
      [13, 'тринадесет'],
      [14, 'четиринадесет'],
      [15, 'петнадесет'],
      [16, 'шестнадесет'],
      [17, 'седемнадесет'],
      [18, 'осемнадесет'],
      [19, 'деветнадесет'],
      [20, 'двадесет'],
      [22, 'двадесет и два'],
      [30, 'тридесет'],
      [60, 'шестдесет'],
      [66, 'шестдесет и шест'],
      [99, 'деветдесет и девет'],
      [100, 'сто'],
      [101, 'сто и един'],
      [112, 'сто и дванадесет'],
      [120, 'сто и двадесет'],
      [123, 'сто двадесет и три'],
      [223, 'двеста двадесет и три'],
      [1000, 'хиляда'],
      [1001, 'хиляда и един'],
      [1010, 'хиляда и десет'],
      [1011, 'хиляда и единадесет'],
      [1100, 'хиляда и сто'],
      [1101, 'хиляда сто и един'],
      [1111, 'хиляда сто и единадесет'],
      [1126, 'хиляда сто двадесет и шест'],
      [2000, 'две хиляди'],
      [2500, 'две хиляди и петстотин']
    ]

    fixtures.each do |f|
      it "male example #{f.first} " do
        expect(f.first.to_words).to eq f.last
      end
    end
  end

  describe 'Female' do
    fixtures = [
      [0, 'нула'],
      [1, 'една'],
      [2, 'две'],
      [3, 'три'],
      [4, 'четири'],
      [5, 'пет'],
      [6, 'шест'],
      [7, 'седем'],
      [8, 'осем'],
      [9, 'девет'],
      [10, 'десет'],
      [11, 'единадесет'],
      [12, 'дванадесет'],
      [13, 'тринадесет'],
      [14, 'четиринадесет'],
      [15, 'петнадесет'],
      [16, 'шестнадесет'],
      [17, 'седемнадесет'],
      [18, 'осемнадесет'],
      [19, 'деветнадесет'],
      [20, 'двадесет'],
      [22, 'двадесет и две'],
      [30, 'тридесет'],
      [60, 'шестдесет'],
      [66, 'шестдесет и шест'],
      [99, 'деветдесет и девет'],
      [100, 'сто'],
      [101, 'сто и една'],
      [112, 'сто и дванадесет'],
      [120, 'сто и двадесет'],
      [123, 'сто двадесет и три'],
      [223, 'двеста двадесет и три'],
      [1000, 'хиляда'],
      [1001, 'хиляда и една'],
      [1010, 'хиляда и десет'],
      [1011, 'хиляда и единадесет'],
      [1100, 'хиляда и сто'],
      [1101, 'хиляда сто и една'],
      [1111, 'хиляда сто и единадесет'],
      [1126, 'хиляда сто двадесет и шест'],
      [2000, 'две хиляди'],
      [2500, 'две хиляди и петстотин']
    ]

    fixtures.each do |f|
      it "female example #{f.first} " do
        expect(f.first.to_words(article: :female)).to eq f.last
      end
    end
  end

end
